---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetalType
source: html/8664a99d-0049-a305-8f70-ce358f71d607.htm
---
# Autodesk.Revit.DB.Visual.MetalType

The enumerated type representing the permitted values for the asset property "MetalType" from the "Metal" schema.

## Syntax (C#)
```csharp
public enum MetalType
```